In [2]:
import pandas as pd

# Creating the Orders DataFrame
orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4, 5],
    'CustomerID': [101, 102, 103, 104, 101],
    'Product': ['A', 'B', 'A', 'C', 'B'],
    'Quantity': [2, 1, 4, 2, 3]
})

# Creating the Customers DataFrame
customers = pd.DataFrame({
    'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})
orders, customers

(   OrderID  CustomerID Product  Quantity
 0        1         101       A         2
 1        2         102       B         1
 2        3         103       A         4
 3        4         104       C         2
 4        5         101       B         3,
    CustomerID     Name     Location
 0         101    Alice     New York
 1         102      Bob  Los Angeles
 2         103  Charlie      Chicago
 3         104    David      Houston)

In [3]:
# 1. Merge the orders and customers DataFrames on the 'CustomerID' column
merged_df = pd.merge(orders, customers, on='CustomerID')
merged_df

   OrderID  CustomerID Product  Quantity     Name     Location
0        1         101       A         2    Alice     New York
1        5         101       B         3    Alice     New York
2        2         102       B         1      Bob  Los Angeles
3        3         103       A         4  Charlie      Chicago
4        4         104       C         2    David      Houston

In [4]:
# 2. Group the merged DataFrame by 'Location' and calculate the total quantity of orders from each location
grouped_location = merged_df.groupby('Location')['Quantity'].sum().reset_index()
grouped_location

      Location  Quantity
0      Chicago         4
1      Houston         2
2  Los Angeles         1
3     New York         5

In [5]:
# 3. Find the customer who placed the highest number of orders
customer_orders = merged_df['Name'].value_counts().idxmax()
customer_orders

'Alice'

In [6]:
# 4. Add a new column 'Total_Quantity' which is the cumulative sum of quantities for each product
merged_df['Total_Quantity'] = merged_df.groupby('Product')['Quantity'].cumsum()
merged_df['Total_Quantity']

0    2
1    3
2    4
3    6
4    2
Name: Total_Quantity, dtype: int64

In [8]:
# 5. Filter the merged DataFrame to show only the orders for products 'A' and 'B'
filtered_df = merged_df[merged_df['Product'].isin(['A', 'B'])]
filtered_df

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        5         101       B         3    Alice     New York               3
2        2         102       B         1      Bob  Los Angeles               4
3        3         103       A         4  Charlie      Chicago               6